#### Terraform working directory 🏠: `demo/demo-account/demo-application/network`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.VPC.module.default_endpoints["VPC-SGP-TST-C-001"].aws_vpc_endpoint.this["dynamodb"] will be destroyed
  # (because aws_vpc_endpoint.this is not in configuration)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-0decabed83655d138" -> null
      - cidr_blocks           = [
          - "35.71.118.0/25",
          - "52.94.11.0/24",
          - "35.71.118.128/26",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-0decabed83655d138" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-67a5400e" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-047992121d2752c83",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.dynamodb" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-071cfc2b058dc7409" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.VPC.module.default_endpoints["VPC-SGP-TST-C-001"].aws_vpc_endpoint.this["s3"] will be destroyed
  # (because aws_vpc_endpoint.this is not in configuration)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-011c2e8d112fbb57d" -> null
      - cidr_blocks           = [
          - "52.219.32.0/21",
          - "3.5.146.0/23",
          - "18.34.248.0/22",
          - "3.5.148.0/22",
          - "18.34.64.0/21",
          - "52.219.40.0/22",
          - "52.219.124.0/22",
          - "52.219.128.0/21",
          - "52.219.184.0/21",
          - "16.12.48.0/21",
          - "52.219.164.0/22",
          - "52.219.180.0/22",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-011c2e8d112fbb57d" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-6fa54006" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-047992121d2752c83",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.s3" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-071cfc2b058dc7409" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.VPC.module.default_endpoints["VPC-SGP-TST-C-002"].aws_vpc_endpoint.this["dynamodb"] will be destroyed
  # (because aws_vpc_endpoint.this is not in configuration)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-0479baa4d3c3ce570" -> null
      - cidr_blocks           = [
          - "35.71.118.0/25",
          - "52.94.11.0/24",
          - "35.71.118.128/26",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-0479baa4d3c3ce570" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-67a5400e" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-09c071bca0ad5ca05",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.dynamodb" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-0a47e5854063b8886" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.VPC.module.default_endpoints["VPC-SGP-TST-C-002"].aws_vpc_endpoint.this["s3"] will be destroyed
  # (because aws_vpc_endpoint.this is not in configuration)
  - resource "aws_vpc_endpoint" "this" {
      - arn                   = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-endpoint/vpce-03a61e77ed2210ef3" -> null
      - cidr_blocks           = [
          - "52.219.32.0/21",
          - "3.5.146.0/23",
          - "18.34.248.0/22",
          - "3.5.148.0/22",
          - "18.34.64.0/21",
          - "52.219.40.0/22",
          - "52.219.124.0/22",
          - "52.219.128.0/21",
          - "52.219.184.0/21",
          - "16.12.48.0/21",
          - "52.219.164.0/22",
          - "52.219.180.0/22",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-03a61e77ed2210ef3" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "129980683758" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-6fa54006" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-09c071bca0ad5ca05",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-southeast-1.s3" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-0a47e5854063b8886" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_default_security_group.this[0] will be destroyed
  # (because aws_default_security_group.this is not in configuration)
  - resource "aws_default_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:129980683758:security-group/sg-0df079e72b7cdf1e6" -> null
      - description            = "default VPC security group" -> null
      - egress                 = [] -> null
      - id                     = "sg-0df079e72b7cdf1e6" -> null
      - ingress                = [] -> null
      - name                   = "default" -> null
      - owner_id               = "129980683758" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "VPC-SGP-TST-C-001"
        } -> null
      - tags_all               = {
          - "Name" = "VPC-SGP-TST-C-001"
        } -> null
      - vpc_id                 = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl.tgw[0] will be destroyed
  # (because aws_network_acl.tgw is not in configuration)
  - resource "aws_network_acl" "tgw" {
      - arn        = "arn:aws:ec2:ap-southeast-1:129980683758:network-acl/acl-0ea4f84a70e76e9a2" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0ea4f84a70e76e9a2" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "129980683758" -> null
      - subnet_ids = [
          - "subnet-040e4ecdfd8bf4911",
          - "subnet-0cce2f09cfaabcb06",
        ] -> null
      - tags       = {
          - "Name" = "VPC-SGP-TST-C-001-tgw"
        } -> null
      - tags_all   = {
          - "Name" = "VPC-SGP-TST-C-001-tgw"
        } -> null
      - vpc_id     = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl_rule.tgw_inbound[0] will be destroyed
  # (because aws_network_acl_rule.tgw_inbound is not in configuration)
  - resource "aws_network_acl_rule" "tgw_inbound" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = false -> null
      - from_port      = 0 -> null
      - id             = "nacl-846600733" -> null
      - network_acl_id = "acl-0ea4f84a70e76e9a2" -> null
      - protocol       = "-1" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 100 -> null
      - to_port        = 0 -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl_rule.tgw_outbound[0] will be destroyed
  # (because aws_network_acl_rule.tgw_outbound is not in configuration)
  - resource "aws_network_acl_rule" "tgw_outbound" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = true -> null
      - from_port      = 0 -> null
      - id             = "nacl-2921037459" -> null
      - network_acl_id = "acl-0ea4f84a70e76e9a2" -> null
      - protocol       = "-1" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 100 -> null
      - to_port        = 0 -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_route_table.intra[0] will be destroyed
  # (because aws_route_table.intra is not in configuration)
  - resource "aws_route_table" "intra" {
      - arn              = "arn:aws:ec2:ap-southeast-1:129980683758:route-table/rtb-047992121d2752c83" -> null
      - id               = "rtb-047992121d2752c83" -> null
      - owner_id         = "129980683758" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"           = "RTB-SGP-TST-PRT-AP01-ALL"
          - "RouteTableType" = "intra"
        } -> null
      - tags_all         = {
          - "Name"           = "RTB-SGP-TST-PRT-AP01-ALL"
          - "RouteTableType" = "intra"
        } -> null
      - vpc_id           = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_route_table.tgw[0] will be destroyed
  # (because aws_route_table.tgw is not in configuration)
  - resource "aws_route_table" "tgw" {
      - arn              = "arn:aws:ec2:ap-southeast-1:129980683758:route-table/rtb-039c9144695db7030" -> null
      - id               = "rtb-039c9144695db7030" -> null
      - owner_id         = "129980683758" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"           = "RTB-SGP-TST-PRT-TGW-ALL"
          - "RouteTableType" = "tgw"
        } -> null
      - tags_all         = {
          - "Name"           = "RTB-SGP-TST-PRT-TGW-ALL"
          - "RouteTableType" = "tgw"
        } -> null
      - vpc_id           = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.intra[0] will be destroyed
  # (because aws_route_table_association.intra is not in configuration)
  - resource "aws_route_table_association" "intra" {
      - id             = "rtbassoc-076f7607de494afba" -> null
      - route_table_id = "rtb-047992121d2752c83" -> null
      - subnet_id      = "subnet-094d2118ee1e67f19" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.intra[1] will be destroyed
  # (because aws_route_table_association.intra is not in configuration)
  - resource "aws_route_table_association" "intra" {
      - id             = "rtbassoc-0f270c1bb6d803ce7" -> null
      - route_table_id = "rtb-047992121d2752c83" -> null
      - subnet_id      = "subnet-033d4cfebd7700712" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.tgw[0] will be destroyed
  # (because aws_route_table_association.tgw is not in configuration)
  - resource "aws_route_table_association" "tgw" {
      - id             = "rtbassoc-0c32b11e36b0e0a81" -> null
      - route_table_id = "rtb-039c9144695db7030" -> null
      - subnet_id      = "subnet-0cce2f09cfaabcb06" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.tgw[1] will be destroyed
  # (because aws_route_table_association.tgw is not in configuration)
  - resource "aws_route_table_association" "tgw" {
      - id             = "rtbassoc-051258a4d542b7f40" -> null
      - route_table_id = "rtb-039c9144695db7030" -> null
      - subnet_id      = "subnet-040e4ecdfd8bf4911" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.intra[0] will be destroyed
  # (because aws_subnet.intra is not in configuration)
  - resource "aws_subnet" "intra" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-094d2118ee1e67f19" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.18.76.0/26" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-094d2118ee1e67f19" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "SN-SGP-TST-PRT-AP01-AZA"
          - "kubernetes.io/role/internal-elb" = "1"
          - "test"                            = "test"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "SN-SGP-TST-PRT-AP01-AZA"
          - "kubernetes.io/role/internal-elb" = "1"
          - "test"                            = "test"
        } -> null
      - vpc_id                                         = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.intra[1] will be destroyed
  # (because aws_subnet.intra is not in configuration)
  - resource "aws_subnet" "intra" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-033d4cfebd7700712" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.18.76.64/26" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-033d4cfebd7700712" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "SN-SGP-TST-PRT-AP01-AZB"
          - "kubernetes.io/role/internal-elb" = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "SN-SGP-TST-PRT-AP01-AZB"
          - "kubernetes.io/role/internal-elb" = "1"
        } -> null
      - vpc_id                                         = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.tgw[0] will be destroyed
  # (because aws_subnet.tgw is not in configuration)
  - resource "aws_subnet" "tgw" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0cce2f09cfaabcb06" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.18.76.128/28" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0cce2f09cfaabcb06" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SN-SGP-TST-PRT-TGW-AZA"
        } -> null
      - tags_all                                       = {
          - "Name" = "SN-SGP-TST-PRT-TGW-AZA"
        } -> null
      - vpc_id                                         = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.tgw[1] will be destroyed
  # (because aws_subnet.tgw is not in configuration)
  - resource "aws_subnet" "tgw" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-040e4ecdfd8bf4911" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.18.76.144/28" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-040e4ecdfd8bf4911" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SN-SGP-TST-PRT-TGW-AZB"
        } -> null
      - tags_all                                       = {
          - "Name" = "SN-SGP-TST-PRT-TGW-AZB"
        } -> null
      - vpc_id                                         = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_vpc.this[0] will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-071cfc2b058dc7409" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "172.18.76.0/25" -> null
      - default_network_acl_id               = "acl-0597a37688b435019" -> null
      - default_route_table_id               = "rtb-0040a938733ece673" -> null
      - default_security_group_id            = "sg-0df079e72b7cdf1e6" -> null
      - dhcp_options_id                      = "dopt-097d189dfd9a00451" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-071cfc2b058dc7409" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0040a938733ece673" -> null
      - owner_id                             = "129980683758" -> null
      - tags                                 = {
          - "Name" = "VPC-SGP-TST-C-001"
        } -> null
      - tags_all                             = {
          - "Name" = "VPC-SGP-TST-C-001"
        } -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_dhcp_options.this[0] will be destroyed
  # (because aws_vpc_dhcp_options.this is not in configuration)
  - resource "aws_vpc_dhcp_options" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:dhcp-options/dopt-097d189dfd9a00451" -> null
      - domain_name_servers  = [
          - "AmazonProvidedDNS",
        ] -> null
      - id                   = "dopt-097d189dfd9a00451" -> null
      - netbios_name_servers = [] -> null
      - ntp_servers          = [
          - "169.254.169.123",
        ] -> null
      - owner_id             = "129980683758" -> null
      - tags                 = {
          - "Name" = "VPC-SGP-TST-C-001"
        } -> null
      - tags_all             = {
          - "Name" = "VPC-SGP-TST-C-001"
        } -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_dhcp_options_association.this[0] will be destroyed
  # (because aws_vpc_dhcp_options_association.this is not in configuration)
  - resource "aws_vpc_dhcp_options_association" "this" {
      - dhcp_options_id = "dopt-097d189dfd9a00451" -> null
      - id              = "dopt-097d189dfd9a00451-vpc-071cfc2b058dc7409" -> null
      - vpc_id          = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_ipv4_cidr_block_association.this[0] will be destroyed
  # (because aws_vpc_ipv4_cidr_block_association.this is not in configuration)
  - resource "aws_vpc_ipv4_cidr_block_association" "this" {
      - cidr_block = "172.18.76.128/26" -> null
      - id         = "vpc-cidr-assoc-00cbf463e1f4387e2" -> null
      - vpc_id     = "vpc-071cfc2b058dc7409" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_default_security_group.this[0] will be destroyed
  # (because aws_default_security_group.this is not in configuration)
  - resource "aws_default_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:129980683758:security-group/sg-007cdec6cbde302bc" -> null
      - description            = "default VPC security group" -> null
      - egress                 = [] -> null
      - id                     = "sg-007cdec6cbde302bc" -> null
      - ingress                = [] -> null
      - name                   = "default" -> null
      - owner_id               = "129980683758" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "VPC-SGP-TST-C-002"
        } -> null
      - tags_all               = {
          - "Name" = "VPC-SGP-TST-C-002"
        } -> null
      - vpc_id                 = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl.tgw[0] will be destroyed
  # (because aws_network_acl.tgw is not in configuration)
  - resource "aws_network_acl" "tgw" {
      - arn        = "arn:aws:ec2:ap-southeast-1:129980683758:network-acl/acl-0ac421c7e66084d70" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0ac421c7e66084d70" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "129980683758" -> null
      - subnet_ids = [
          - "subnet-0a9ba4357788f231e",
          - "subnet-0e1b807e448944c94",
        ] -> null
      - tags       = {
          - "Name" = "VPC-SGP-TST-C-002-tgw"
        } -> null
      - tags_all   = {
          - "Name" = "VPC-SGP-TST-C-002-tgw"
        } -> null
      - vpc_id     = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl_rule.tgw_inbound[0] will be destroyed
  # (because aws_network_acl_rule.tgw_inbound is not in configuration)
  - resource "aws_network_acl_rule" "tgw_inbound" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = false -> null
      - from_port      = 0 -> null
      - id             = "nacl-3571383617" -> null
      - network_acl_id = "acl-0ac421c7e66084d70" -> null
      - protocol       = "-1" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 100 -> null
      - to_port        = 0 -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl_rule.tgw_outbound[0] will be destroyed
  # (because aws_network_acl_rule.tgw_outbound is not in configuration)
  - resource "aws_network_acl_rule" "tgw_outbound" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = true -> null
      - from_port      = 0 -> null
      - id             = "nacl-1704993756" -> null
      - network_acl_id = "acl-0ac421c7e66084d70" -> null
      - protocol       = "-1" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 100 -> null
      - to_port        = 0 -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_route_table.intra[0] will be destroyed
  # (because aws_route_table.intra is not in configuration)
  - resource "aws_route_table" "intra" {
      - arn              = "arn:aws:ec2:ap-southeast-1:129980683758:route-table/rtb-09c071bca0ad5ca05" -> null
      - id               = "rtb-09c071bca0ad5ca05" -> null
      - owner_id         = "129980683758" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"           = "RTB-SGP-TST-PRT-AP02-ALL"
          - "RouteTableType" = "intra"
        } -> null
      - tags_all         = {
          - "Name"           = "RTB-SGP-TST-PRT-AP02-ALL"
          - "RouteTableType" = "intra"
        } -> null
      - vpc_id           = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_route_table.tgw[0] will be destroyed
  # (because aws_route_table.tgw is not in configuration)
  - resource "aws_route_table" "tgw" {
      - arn              = "arn:aws:ec2:ap-southeast-1:129980683758:route-table/rtb-037064c0e16b5f581" -> null
      - id               = "rtb-037064c0e16b5f581" -> null
      - owner_id         = "129980683758" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"           = "RTB-SGP-TST-02-PRT-TGW-ALL"
          - "RouteTableType" = "tgw"
        } -> null
      - tags_all         = {
          - "Name"           = "RTB-SGP-TST-02-PRT-TGW-ALL"
          - "RouteTableType" = "tgw"
        } -> null
      - vpc_id           = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.intra[0] will be destroyed
  # (because aws_route_table_association.intra is not in configuration)
  - resource "aws_route_table_association" "intra" {
      - id             = "rtbassoc-0cb41437dbc6c0a18" -> null
      - route_table_id = "rtb-09c071bca0ad5ca05" -> null
      - subnet_id      = "subnet-05f9228c88d891210" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.intra[1] will be destroyed
  # (because aws_route_table_association.intra is not in configuration)
  - resource "aws_route_table_association" "intra" {
      - id             = "rtbassoc-0fcf6d97f2b8c614c" -> null
      - route_table_id = "rtb-09c071bca0ad5ca05" -> null
      - subnet_id      = "subnet-034369f43014672fd" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.tgw[0] will be destroyed
  # (because aws_route_table_association.tgw is not in configuration)
  - resource "aws_route_table_association" "tgw" {
      - id             = "rtbassoc-0a4a67125befbd555" -> null
      - route_table_id = "rtb-037064c0e16b5f581" -> null
      - subnet_id      = "subnet-0e1b807e448944c94" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.tgw[1] will be destroyed
  # (because aws_route_table_association.tgw is not in configuration)
  - resource "aws_route_table_association" "tgw" {
      - id             = "rtbassoc-0fe9caf7af3f86c20" -> null
      - route_table_id = "rtb-037064c0e16b5f581" -> null
      - subnet_id      = "subnet-0a9ba4357788f231e" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.intra[0] will be destroyed
  # (because aws_subnet.intra is not in configuration)
  - resource "aws_subnet" "intra" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-05f9228c88d891210" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.19.76.0/26" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-05f9228c88d891210" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SN-SGP-TST-PRT-AP02-AZA"
        } -> null
      - tags_all                                       = {
          - "Name" = "SN-SGP-TST-PRT-AP02-AZA"
        } -> null
      - vpc_id                                         = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.intra[1] will be destroyed
  # (because aws_subnet.intra is not in configuration)
  - resource "aws_subnet" "intra" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-034369f43014672fd" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.19.76.64/26" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-034369f43014672fd" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SN-SGP-TST-PRT-AP02-AZB"
        } -> null
      - tags_all                                       = {
          - "Name" = "SN-SGP-TST-PRT-AP02-AZB"
        } -> null
      - vpc_id                                         = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.tgw[0] will be destroyed
  # (because aws_subnet.tgw is not in configuration)
  - resource "aws_subnet" "tgw" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0e1b807e448944c94" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.19.76.128/28" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e1b807e448944c94" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SN-SGP-TST-02-PRT-TGW-AZA"
        } -> null
      - tags_all                                       = {
          - "Name" = "SN-SGP-TST-02-PRT-TGW-AZA"
        } -> null
      - vpc_id                                         = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.tgw[1] will be destroyed
  # (because aws_subnet.tgw is not in configuration)
  - resource "aws_subnet" "tgw" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0a9ba4357788f231e" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.19.76.144/28" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a9ba4357788f231e" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "129980683758" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "SN-SGP-TST-02-PRT-TGW-AZB"
        } -> null
      - tags_all                                       = {
          - "Name" = "SN-SGP-TST-02-PRT-TGW-AZB"
        } -> null
      - vpc_id                                         = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_vpc.this[0] will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-0a47e5854063b8886" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "172.19.76.0/25" -> null
      - default_network_acl_id               = "acl-038ade27fb70a61e8" -> null
      - default_route_table_id               = "rtb-0e2f85e9df3a0d3e6" -> null
      - default_security_group_id            = "sg-007cdec6cbde302bc" -> null
      - dhcp_options_id                      = "dopt-01f2d64f5a9000f96" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0a47e5854063b8886" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0e2f85e9df3a0d3e6" -> null
      - owner_id                             = "129980683758" -> null
      - tags                                 = {
          - "Name" = "VPC-SGP-TST-C-002"
        } -> null
      - tags_all                             = {
          - "Name" = "VPC-SGP-TST-C-002"
        } -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_dhcp_options.this[0] will be destroyed
  # (because aws_vpc_dhcp_options.this is not in configuration)
  - resource "aws_vpc_dhcp_options" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:dhcp-options/dopt-01f2d64f5a9000f96" -> null
      - domain_name_servers  = [
          - "AmazonProvidedDNS",
        ] -> null
      - id                   = "dopt-01f2d64f5a9000f96" -> null
      - netbios_name_servers = [] -> null
      - ntp_servers          = [
          - "169.254.169.123",
        ] -> null
      - owner_id             = "129980683758" -> null
      - tags                 = {
          - "Name" = "VPC-SGP-TST-C-002"
        } -> null
      - tags_all             = {
          - "Name" = "VPC-SGP-TST-C-002"
        } -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_dhcp_options_association.this[0] will be destroyed
  # (because aws_vpc_dhcp_options_association.this is not in configuration)
  - resource "aws_vpc_dhcp_options_association" "this" {
      - dhcp_options_id = "dopt-01f2d64f5a9000f96" -> null
      - id              = "dopt-01f2d64f5a9000f96-vpc-0a47e5854063b8886" -> null
      - vpc_id          = "vpc-0a47e5854063b8886" -> null
    }

  # module.VPC.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_ipv4_cidr_block_association.this[0] will be destroyed
  # (because aws_vpc_ipv4_cidr_block_association.this is not in configuration)
  - resource "aws_vpc_ipv4_cidr_block_association" "this" {
      - cidr_block = "172.19.76.128/26" -> null
      - id         = "vpc-cidr-assoc-04d399cca9c71fc57" -> null
      - vpc_id     = "vpc-0a47e5854063b8886" -> null
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-001"].aws_vpc_endpoint.this["dynamodb"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-001"].aws_vpc_endpoint.this["s3"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-002"].aws_vpc_endpoint.this["dynamodb"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-002"].aws_vpc_endpoint.this["s3"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + tags_all               = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl.tgw[0] will be created
  + resource "aws_network_acl" "tgw" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "VPC-SGP-TST-C-001-tgw"
        }
      + tags_all   = {
          + "Name" = "VPC-SGP-TST-C-001-tgw"
        }
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl_rule.tgw_inbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl_rule.tgw_outbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-PRT-AP01-ALL"
          + "RouteTableType" = "intra"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-PRT-AP01-ALL"
          + "RouteTableType" = "intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table.tgw[0] will be created
  + resource "aws_route_table" "tgw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.tgw[0] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.tgw[1] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZA"
          + "kubernetes.io/role/internal-elb" = "1"
          + "test"                            = "test"
        }
      + tags_all                                       = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZA"
          + "kubernetes.io/role/internal-elb" = "1"
          + "test"                            = "test"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZB"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZB"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.tgw[0] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.128/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZA"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.tgw[1] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.144/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZB"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.18.76.0/25"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + tags_all                             = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name_servers  = [
          + "AmazonProvidedDNS",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = [
          + "169.254.169.123",
        ]
      + owner_id             = (known after apply)
      + tags                 = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + tags_all             = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "172.18.76.128/26"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + tags_all               = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl.tgw[0] will be created
  + resource "aws_network_acl" "tgw" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "VPC-SGP-TST-C-002-tgw"
        }
      + tags_all   = {
          + "Name" = "VPC-SGP-TST-C-002-tgw"
        }
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl_rule.tgw_inbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl_rule.tgw_outbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-PRT-AP02-ALL"
          + "RouteTableType" = "intra"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-PRT-AP02-ALL"
          + "RouteTableType" = "intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table.tgw[0] will be created
  + resource "aws_route_table" "tgw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-02-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-02-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.tgw[0] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.tgw[1] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZA"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZB"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.tgw[0] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.128/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZA"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.tgw[1] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.144/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZB"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.19.76.0/25"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + tags_all                             = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name_servers  = [
          + "AmazonProvidedDNS",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = [
          + "169.254.169.123",
        ]
      + owner_id             = (known after apply)
      + tags                 = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + tags_all             = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "172.19.76.128/26"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

Plan: 40 to add, 0 to change, 40 to destroy.

Changes to Outputs:
  ~ account_vpc_module = {
      - PRD-APP         = {
          - vpc_subnets_map = {
              - VPC-SGP-TST-C-001 = {
                  - "172.18.76.0/26"   = "subnet-094d2118ee1e67f19"
                  - "172.18.76.128/28" = "subnet-0cce2f09cfaabcb06"
                  - "172.18.76.144/28" = "subnet-040e4ecdfd8bf4911"
                  - "172.18.76.64/26"  = "subnet-033d4cfebd7700712"
                }
              - VPC-SGP-TST-C-002 = {
                  - "172.19.76.0/26"   = "subnet-05f9228c88d891210"
                  - "172.19.76.128/28" = "subnet-0e1b807e448944c94"
                  - "172.19.76.144/28" = "subnet-0a9ba4357788f231e"
                  - "172.19.76.64/26"  = "subnet-034369f43014672fd"
                }
            }
          - vpcs            = {
              - VPC-SGP-TST-C-001 = {
                  - azs                                         = [
                      - "ap-southeast-1a",
                      - "ap-southeast-1b",
                    ]
                  - cgw_arns                                    = []
                  - cgw_ids                                     = []
                  - default_network_acl_id                      = "acl-0597a37688b435019"
                  - default_route_table_id                      = "rtb-0040a938733ece673"
                  - default_security_group_id                   = "sg-0df079e72b7cdf1e6"
                  - default_vpc_arn                             = ""
                  - default_vpc_cidr_block                      = ""
                  - default_vpc_default_network_acl_id          = ""
                  - default_vpc_default_route_table_id          = ""
                  - default_vpc_default_security_group_id       = ""
                  - default_vpc_enable_dns_hostnames            = ""
                  - default_vpc_enable_dns_support              = ""
                  - default_vpc_id                              = ""
                  - default_vpc_instance_tenancy                = ""
                  - default_vpc_main_route_table_id             = ""
                  - dhcp_options_id                             = "dopt-097d189dfd9a00451"
                  - egress_only_internet_gateway_id             = ""
                  - elasticache_network_acl_arn                 = ""
                  - elasticache_network_acl_id                  = ""
                  - elasticache_route_table_association_ids     = []
                  - elasticache_route_table_ids                 = []
                  - elasticache_subnet_arns                     = []
                  - elasticache_subnet_group                    = ""
                  - elasticache_subnet_group_name               = ""
                  - elasticache_subnets                         = []
                  - elasticache_subnets_cidr_blocks             = []
                  - elasticache_subnets_ipv6_cidr_blocks        = []
                  - igw_arn                                     = ""
                  - igw_id                                      = ""
                  - intra_network_acl_arn                       = ""
                  - intra_network_acl_id                        = ""
                  - intra_route_table_association_ids           = [
                      - "rtbassoc-076f7607de494afba",
                      - "rtbassoc-0f270c1bb6d803ce7",
                    ]
                  - intra_route_table_ids                       = [
                      - "rtb-047992121d2752c83",
                    ]
                  - intra_route_table_tags                      = [
                      - {
                          - Name           = "RTB-SGP-TST-PRT-AP01-ALL"
                          - RouteTableType = "intra"
                        },
                    ]
                  - intra_subnet_arns                           = [
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-094d2118ee1e67f19",
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-033d4cfebd7700712",
                    ]
                  - intra_subnets                               = [
                      - "subnet-094d2118ee1e67f19",
                      - "subnet-033d4cfebd7700712",
                    ]
                  - intra_subnets_cidr_blocks                   = [
                      - "172.18.76.0/26",
                      - "172.18.76.64/26",
                    ]
                  - intra_subnets_ipv6_cidr_blocks              = [
                      - "",
                      - "",
                    ]
                  - name                                        = "VPC-SGP-TST-C-001"
                  - nat_ids                                     = []
                  - nat_public_ips                              = []
                  - natgw_ids                                   = []
                  - outpost_network_acl_arn                     = ""
                  - outpost_network_acl_id                      = ""
                  - outpost_subnet_arns                         = []
                  - outpost_subnets                             = []
                  - outpost_subnets_cidr_blocks                 = []
                  - outpost_subnets_ipv6_cidr_blocks            = []
                  - private_ipv6_egress_route_ids               = []
                  - private_nat_gateway_route_ids               = []
                  - private_network_acl_arn                     = ""
                  - private_network_acl_id                      = ""
                  - private_route_table_association_ids         = []
                  - private_route_table_ids                     = []
                  - private_route_table_tags                    = []
                  - private_subnet_arns                         = []
                  - private_subnets                             = []
                  - private_subnets_cidr_blocks                 = []
                  - private_subnets_ipv6_cidr_blocks            = []
                  - public_internet_gateway_ipv6_route_id       = ""
                  - public_internet_gateway_route_id            = ""
                  - public_network_acl_arn                      = ""
                  - public_network_acl_id                       = ""
                  - public_route_table_association_ids          = []
                  - public_route_table_ids                      = []
                  - public_route_table_tags                     = []
                  - public_subnet_arns                          = []
                  - public_subnets                              = []
                  - public_subnets_cidr_blocks                  = []
                  - public_subnets_ipv6_cidr_blocks             = []
                  - redshift_network_acl_arn                    = ""
                  - redshift_network_acl_id                     = ""
                  - redshift_public_route_table_association_ids = []
                  - redshift_route_table_association_ids        = []
                  - redshift_route_table_ids                    = []
                  - redshift_subnet_arns                        = []
                  - redshift_subnet_group                       = ""
                  - redshift_subnets                            = []
                  - redshift_subnets_cidr_blocks                = []
                  - redshift_subnets_ipv6_cidr_blocks           = []
                  - route_tables                                = {
                      - rtb-039c9144695db7030 = {
                          - Name           = "RTB-SGP-TST-PRT-TGW-ALL"
                          - RouteTableType = "tgw"
                        }
                      - rtb-047992121d2752c83 = {
                          - Name           = "RTB-SGP-TST-PRT-AP01-ALL"
                          - RouteTableType = "intra"
                        }
                    }
                  - tgw_internet_gateway_route_id               = ""
                  - tgw_ipv6_egress_route_id                    = ""
                  - tgw_nat_gateway_route_ids                   = []
                  - tgw_network_acl_arn                         = "arn:aws:ec2:ap-southeast-1:129980683758:network-acl/acl-0ea4f84a70e76e9a2"
                  - tgw_network_acl_id                          = "acl-0ea4f84a70e76e9a2"
                  - tgw_route_table_association_ids             = [
                      - "rtbassoc-0c32b11e36b0e0a81",
                      - "rtbassoc-051258a4d542b7f40",
                    ]
                  - tgw_route_table_ids                         = [
                      - "rtb-039c9144695db7030",
                    ]
                  - tgw_route_table_tags                        = [
                      - {
                          - Name           = "RTB-SGP-TST-PRT-TGW-ALL"
                          - RouteTableType = "tgw"
                        },
                    ]
                  - tgw_subnet_arns                             = [
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0cce2f09cfaabcb06",
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-040e4ecdfd8bf4911",
                    ]
                  - tgw_subnets                                 = [
                      - "subnet-0cce2f09cfaabcb06",
                      - "subnet-040e4ecdfd8bf4911",
                    ]
                  - tgw_subnets_cidr_blocks                     = [
                      - "172.18.76.128/28",
                      - "172.18.76.144/28",
                    ]
                  - tgw_subnets_ipv6_cidr_blocks                = [
                      - "",
                      - "",
                    ]
                  - this_customer_gateway                       = {}
                  - vgw_arn                                     = ""
                  - vgw_id                                      = ""
                  - vpc_arn                                     = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-071cfc2b058dc7409"
                  - vpc_cidr_block                              = "172.18.76.0/25"
                  - vpc_enable_dns_hostnames                    = true
                  - vpc_enable_dns_support                      = true
                  - vpc_flow_log_cloudwatch_iam_role_arn        = ""
                  - vpc_flow_log_destination_arn                = ""
                  - vpc_flow_log_destination_type               = "cloud-watch-logs"
                  - vpc_flow_log_id                             = ""
                  - vpc_id                                      = "vpc-071cfc2b058dc7409"
                  - vpc_instance_tenancy                        = "default"
                  - vpc_ipv6_association_id                     = ""
                  - vpc_ipv6_cidr_block                         = ""
                  - vpc_main_route_table_id                     = "rtb-0040a938733ece673"
                  - vpc_owner_id                                = "129980683758"
                  - vpc_secondary_cidr_blocks                   = [
                      - "172.18.76.128/26",
                    ]
                }
              - VPC-SGP-TST-C-002 = {
                  - azs                                         = [
                      - "ap-southeast-1a",
                      - "ap-southeast-1b",
                    ]
                  - cgw_arns                                    = []
                  - cgw_ids                                     = []
                  - default_network_acl_id                      = "acl-038ade27fb70a61e8"
                  - default_route_table_id                      = "rtb-0e2f85e9df3a0d3e6"
                  - default_security_group_id                   = "sg-007cdec6cbde302bc"
                  - default_vpc_arn                             = ""
                  - default_vpc_cidr_block                      = ""
                  - default_vpc_default_network_acl_id          = ""
                  - default_vpc_default_route_table_id          = ""
                  - default_vpc_default_security_group_id       = ""
                  - default_vpc_enable_dns_hostnames            = ""
                  - default_vpc_enable_dns_support              = ""
                  - default_vpc_id                              = ""
                  - default_vpc_instance_tenancy                = ""
                  - default_vpc_main_route_table_id             = ""
                  - dhcp_options_id                             = "dopt-01f2d64f5a9000f96"
                  - egress_only_internet_gateway_id             = ""
                  - elasticache_network_acl_arn                 = ""
                  - elasticache_network_acl_id                  = ""
                  - elasticache_route_table_association_ids     = []
                  - elasticache_route_table_ids                 = []
                  - elasticache_subnet_arns                     = []
                  - elasticache_subnet_group                    = ""
                  - elasticache_subnet_group_name               = ""
                  - elasticache_subnets                         = []
                  - elasticache_subnets_cidr_blocks             = []
                  - elasticache_subnets_ipv6_cidr_blocks        = []
                  - igw_arn                                     = ""
                  - igw_id                                      = ""
                  - intra_network_acl_arn                       = ""
                  - intra_network_acl_id                        = ""
                  - intra_route_table_association_ids           = [
                      - "rtbassoc-0cb41437dbc6c0a18",
                      - "rtbassoc-0fcf6d97f2b8c614c",
                    ]
                  - intra_route_table_ids                       = [
                      - "rtb-09c071bca0ad5ca05",
                    ]
                  - intra_route_table_tags                      = [
                      - {
                          - Name           = "RTB-SGP-TST-PRT-AP02-ALL"
                          - RouteTableType = "intra"
                        },
                    ]
                  - intra_subnet_arns                           = [
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-05f9228c88d891210",
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-034369f43014672fd",
                    ]
                  - intra_subnets                               = [
                      - "subnet-05f9228c88d891210",
                      - "subnet-034369f43014672fd",
                    ]
                  - intra_subnets_cidr_blocks                   = [
                      - "172.19.76.0/26",
                      - "172.19.76.64/26",
                    ]
                  - intra_subnets_ipv6_cidr_blocks              = [
                      - "",
                      - "",
                    ]
                  - name                                        = "VPC-SGP-TST-C-002"
                  - nat_ids                                     = []
                  - nat_public_ips                              = []
                  - natgw_ids                                   = []
                  - outpost_network_acl_arn                     = ""
                  - outpost_network_acl_id                      = ""
                  - outpost_subnet_arns                         = []
                  - outpost_subnets                             = []
                  - outpost_subnets_cidr_blocks                 = []
                  - outpost_subnets_ipv6_cidr_blocks            = []
                  - private_ipv6_egress_route_ids               = []
                  - private_nat_gateway_route_ids               = []
                  - private_network_acl_arn                     = ""
                  - private_network_acl_id                      = ""
                  - private_route_table_association_ids         = []
                  - private_route_table_ids                     = []
                  - private_route_table_tags                    = []
                  - private_subnet_arns                         = []
                  - private_subnets                             = []
                  - private_subnets_cidr_blocks                 = []
                  - private_subnets_ipv6_cidr_blocks            = []
                  - public_internet_gateway_ipv6_route_id       = ""
                  - public_internet_gateway_route_id            = ""
                  - public_network_acl_arn                      = ""
                  - public_network_acl_id                       = ""
                  - public_route_table_association_ids          = []
                  - public_route_table_ids                      = []
                  - public_route_table_tags                     = []
                  - public_subnet_arns                          = []
                  - public_subnets                              = []
                  - public_subnets_cidr_blocks                  = []
                  - public_subnets_ipv6_cidr_blocks             = []
                  - redshift_network_acl_arn                    = ""
                  - redshift_network_acl_id                     = ""
                  - redshift_public_route_table_association_ids = []
                  - redshift_route_table_association_ids        = []
                  - redshift_route_table_ids                    = []
                  - redshift_subnet_arns                        = []
                  - redshift_subnet_group                       = ""
                  - redshift_subnets                            = []
                  - redshift_subnets_cidr_blocks                = []
                  - redshift_subnets_ipv6_cidr_blocks           = []
                  - route_tables                                = {
                      - rtb-037064c0e16b5f581 = {
                          - Name           = "RTB-SGP-TST-02-PRT-TGW-ALL"
                          - RouteTableType = "tgw"
                        }
                      - rtb-09c071bca0ad5ca05 = {
                          - Name           = "RTB-SGP-TST-PRT-AP02-ALL"
                          - RouteTableType = "intra"
                        }
                    }
                  - tgw_internet_gateway_route_id               = ""
                  - tgw_ipv6_egress_route_id                    = ""
                  - tgw_nat_gateway_route_ids                   = []
                  - tgw_network_acl_arn                         = "arn:aws:ec2:ap-southeast-1:129980683758:network-acl/acl-0ac421c7e66084d70"
                  - tgw_network_acl_id                          = "acl-0ac421c7e66084d70"
                  - tgw_route_table_association_ids             = [
                      - "rtbassoc-0a4a67125befbd555",
                      - "rtbassoc-0fe9caf7af3f86c20",
                    ]
                  - tgw_route_table_ids                         = [
                      - "rtb-037064c0e16b5f581",
                    ]
                  - tgw_route_table_tags                        = [
                      - {
                          - Name           = "RTB-SGP-TST-02-PRT-TGW-ALL"
                          - RouteTableType = "tgw"
                        },
                    ]
                  - tgw_subnet_arns                             = [
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0e1b807e448944c94",
                      - "arn:aws:ec2:ap-southeast-1:129980683758:subnet/subnet-0a9ba4357788f231e",
                    ]
                  - tgw_subnets                                 = [
                      - "subnet-0e1b807e448944c94",
                      - "subnet-0a9ba4357788f231e",
                    ]
                  - tgw_subnets_cidr_blocks                     = [
                      - "172.19.76.128/28",
                      - "172.19.76.144/28",
                    ]
                  - tgw_subnets_ipv6_cidr_blocks                = [
                      - "",
                      - "",
                    ]
                  - this_customer_gateway                       = {}
                  - vgw_arn                                     = ""
                  - vgw_id                                      = ""
                  - vpc_arn                                     = "arn:aws:ec2:ap-southeast-1:129980683758:vpc/vpc-0a47e5854063b8886"
                  - vpc_cidr_block                              = "172.19.76.0/25"
                  - vpc_enable_dns_hostnames                    = true
                  - vpc_enable_dns_support                      = true
                  - vpc_flow_log_cloudwatch_iam_role_arn        = ""
                  - vpc_flow_log_destination_arn                = ""
                  - vpc_flow_log_destination_type               = "cloud-watch-logs"
                  - vpc_flow_log_id                             = ""
                  - vpc_id                                      = "vpc-0a47e5854063b8886"
                  - vpc_instance_tenancy                        = "default"
                  - vpc_ipv6_association_id                     = ""
                  - vpc_ipv6_cidr_block                         = ""
                  - vpc_main_route_table_id                     = "rtb-0e2f85e9df3a0d3e6"
                  - vpc_owner_id                                = "129980683758"
                  - vpc_secondary_cidr_blocks                   = [
                      - "172.19.76.128/26",
                    ]
                }
            }
        }
      + vpc_subnets_map = {
          + VPC-SGP-TST-C-001 = {
              + "172.18.76.0/26"   = (known after apply)
              + "172.18.76.128/28" = (known after apply)
              + "172.18.76.144/28" = (known after apply)
              + "172.18.76.64/26"  = (known after apply)
            }
          + VPC-SGP-TST-C-002 = {
              + "172.19.76.0/26"   = (known after apply)
              + "172.19.76.128/28" = (known after apply)
              + "172.19.76.144/28" = (known after apply)
              + "172.19.76.64/26"  = (known after apply)
            }
        }
      + vpcs            = {
          + VPC-SGP-TST-C-001 = {
              + azs                                         = [
                  + "ap-southeast-1a",
                  + "ap-southeast-1b",
                ]
              + cgw_arns                                    = []
              + cgw_ids                                     = []
              + default_network_acl_id                      = (known after apply)
              + default_route_table_id                      = (known after apply)
              + default_security_group_id                   = (known after apply)
              + default_vpc_arn                             = ""
              + default_vpc_cidr_block                      = ""
              + default_vpc_default_network_acl_id          = ""
              + default_vpc_default_route_table_id          = ""
              + default_vpc_default_security_group_id       = ""
              + default_vpc_enable_dns_hostnames            = ""
              + default_vpc_enable_dns_support              = ""
              + default_vpc_id                              = ""
              + default_vpc_instance_tenancy                = ""
              + default_vpc_main_route_table_id             = ""
              + dhcp_options_id                             = (known after apply)
              + egress_only_internet_gateway_id             = ""
              + elasticache_network_acl_arn                 = ""
              + elasticache_network_acl_id                  = ""
              + elasticache_route_table_association_ids     = []
              + elasticache_route_table_ids                 = []
              + elasticache_subnet_arns                     = []
              + elasticache_subnet_group                    = ""
              + elasticache_subnet_group_name               = ""
              + elasticache_subnets                         = []
              + elasticache_subnets_cidr_blocks             = []
              + elasticache_subnets_ipv6_cidr_blocks        = []
              + igw_arn                                     = ""
              + igw_id                                      = ""
              + intra_network_acl_arn                       = ""
              + intra_network_acl_id                        = ""
              + intra_route_table_association_ids           = [
                  + (known after apply),
                  + (known after apply),
                ]
              + intra_route_table_ids                       = [
                  + (known after apply),
                ]
              + intra_route_table_tags                      = [
                  + {
                      + Name           = "RTB-SGP-TST-PRT-AP01-ALL"
                      + RouteTableType = "intra"
                    },
                ]
              + intra_subnet_arns                           = [
                  + (known after apply),
                  + (known after apply),
                ]
              + intra_subnets                               = [
                  + (known after apply),
                  + (known after apply),
                ]
              + intra_subnets_cidr_blocks                   = [
                  + "172.18.76.0/26",
                  + "172.18.76.64/26",
                ]
              + intra_subnets_ipv6_cidr_blocks              = [
                  + null,
                  + null,
                ]
              + name                                        = "VPC-SGP-TST-C-001"
              + nat_ids                                     = []
              + nat_public_ips                              = []
              + natgw_ids                                   = []
              + outpost_network_acl_arn                     = ""
              + outpost_network_acl_id                      = ""
              + outpost_subnet_arns                         = []
              + outpost_subnets                             = []
              + outpost_subnets_cidr_blocks                 = []
              + outpost_subnets_ipv6_cidr_blocks            = []
              + private_ipv6_egress_route_ids               = []
              + private_nat_gateway_route_ids               = []
              + private_network_acl_arn                     = ""
              + private_network_acl_id                      = ""
              + private_route_table_association_ids         = []
              + private_route_table_ids                     = []
              + private_route_table_tags                    = []
              + private_subnet_arns                         = []
              + private_subnets                             = []
              + private_subnets_cidr_blocks                 = []
              + private_subnets_ipv6_cidr_blocks            = []
              + public_internet_gateway_ipv6_route_id       = ""
              + public_internet_gateway_route_id            = ""
              + public_network_acl_arn                      = ""
              + public_network_acl_id                       = ""
              + public_route_table_association_ids          = []
              + public_route_table_ids                      = []
              + public_route_table_tags                     = []
              + public_subnet_arns                          = []
              + public_subnets                              = []
              + public_subnets_cidr_blocks                  = []
              + public_subnets_ipv6_cidr_blocks             = []
              + redshift_network_acl_arn                    = ""
              + redshift_network_acl_id                     = ""
              + redshift_public_route_table_association_ids = []
              + redshift_route_table_association_ids        = []
              + redshift_route_table_ids                    = []
              + redshift_subnet_arns                        = []
              + redshift_subnet_group                       = ""
              + redshift_subnets                            = []
              + redshift_subnets_cidr_blocks                = []
              + redshift_subnets_ipv6_cidr_blocks           = []
              + route_tables                                = (known after apply)
              + tgw_internet_gateway_route_id               = ""
              + tgw_ipv6_egress_route_id                    = ""
              + tgw_nat_gateway_route_ids                   = []
              + tgw_network_acl_arn                         = (known after apply)
              + tgw_network_acl_id                          = (known after apply)
              + tgw_route_table_association_ids             = [
                  + (known after apply),
                  + (known after apply),
                ]
              + tgw_route_table_ids                         = (known after apply)
              + tgw_route_table_tags                        = [
                  + {
                      + Name           = "RTB-SGP-TST-PRT-TGW-ALL"
                      + RouteTableType = "tgw"
                    },
                ]
              + tgw_subnet_arns                             = [
                  + (known after apply),
                  + (known after apply),
                ]
              + tgw_subnets                                 = [
                  + (known after apply),
                  + (known after apply),
                ]
              + tgw_subnets_cidr_blocks                     = [
                  + "172.18.76.128/28",
                  + "172.18.76.144/28",
                ]
              + tgw_subnets_ipv6_cidr_blocks                = [
                  + null,
                  + null,
                ]
              + this_customer_gateway                       = {}
              + vgw_arn                                     = ""
              + vgw_id                                      = ""
              + vpc_arn                                     = (known after apply)
              + vpc_cidr_block                              = "172.18.76.0/25"
              + vpc_enable_dns_hostnames                    = true
              + vpc_enable_dns_support                      = true
              + vpc_flow_log_cloudwatch_iam_role_arn        = ""
              + vpc_flow_log_destination_arn                = ""
              + vpc_flow_log_destination_type               = "cloud-watch-logs"
              + vpc_flow_log_id                             = ""
              + vpc_id                                      = (known after apply)
              + vpc_instance_tenancy                        = "default"
              + vpc_ipv6_association_id                     = (known after apply)
              + vpc_ipv6_cidr_block                         = (known after apply)
              + vpc_main_route_table_id                     = (known after apply)
              + vpc_owner_id                                = (known after apply)
              + vpc_secondary_cidr_blocks                   = [
                  + "172.18.76.128/26",
                ]
            }
          + VPC-SGP-TST-C-002 = {
              + azs                                         = [
                  + "ap-southeast-1a",
                  + "ap-southeast-1b",
                ]
              + cgw_arns                                    = []
              + cgw_ids                                     = []
              + default_network_acl_id                      = (known after apply)
              + default_route_table_id                      = (known after apply)
              + default_security_group_id                   = (known after apply)
              + default_vpc_arn                             = ""
              + default_vpc_cidr_block                      = ""
              + default_vpc_default_network_acl_id          = ""
              + default_vpc_default_route_table_id          = ""
              + default_vpc_default_security_group_id       = ""
              + default_vpc_enable_dns_hostnames            = ""
              + default_vpc_enable_dns_support              = ""
              + default_vpc_id                              = ""
              + default_vpc_instance_tenancy                = ""
              + default_vpc_main_route_table_id             = ""
              + dhcp_options_id                             = (known after apply)
              + egress_only_internet_gateway_id             = ""
              + elasticache_network_acl_arn                 = ""
              + elasticache_network_acl_id                  = ""
              + elasticache_route_table_association_ids     = []
              + elasticache_route_table_ids                 = []
              + elasticache_subnet_arns                     = []
              + elasticache_subnet_group                    = ""
              + elasticache_subnet_group_name               = ""
              + elasticache_subnets                         = []
              + elasticache_subnets_cidr_blocks             = []
              + elasticache_subnets_ipv6_cidr_blocks        = []
              + igw_arn                                     = ""
              + igw_id                                      = ""
              + intra_network_acl_arn                       = ""
              + intra_network_acl_id                        = ""
              + intra_route_table_association_ids           = [
                  + (known after apply),
                  + (known after apply),
                ]
              + intra_route_table_ids                       = [
                  + (known after apply),
                ]
              + intra_route_table_tags                      = [
                  + {
                      + Name           = "RTB-SGP-TST-PRT-AP02-ALL"
                      + RouteTableType = "intra"
                    },
                ]
              + intra_subnet_arns                           = [
                  + (known after apply),
                  + (known after apply),
                ]
              + intra_subnets                               = [
                  + (known after apply),
                  + (known after apply),
                ]
              + intra_subnets_cidr_blocks                   = [
                  + "172.19.76.0/26",
                  + "172.19.76.64/26",
                ]
              + intra_subnets_ipv6_cidr_blocks              = [
                  + null,
                  + null,
                ]
              + name                                        = "VPC-SGP-TST-C-002"
              + nat_ids                                     = []
              + nat_public_ips                              = []
              + natgw_ids                                   = []
              + outpost_network_acl_arn                     = ""
              + outpost_network_acl_id                      = ""
              + outpost_subnet_arns                         = []
              + outpost_subnets                             = []
              + outpost_subnets_cidr_blocks                 = []
              + outpost_subnets_ipv6_cidr_blocks            = []
              + private_ipv6_egress_route_ids               = []
              + private_nat_gateway_route_ids               = []
              + private_network_acl_arn                     = ""
              + private_network_acl_id                      = ""
              + private_route_table_association_ids         = []
              + private_route_table_ids                     = []
              + private_route_table_tags                    = []
              + private_subnet_arns                         = []
              + private_subnets                             = []
              + private_subnets_cidr_blocks                 = []
              + private_subnets_ipv6_cidr_blocks            = []
              + public_internet_gateway_ipv6_route_id       = ""
              + public_internet_gateway_route_id            = ""
              + public_network_acl_arn                      = ""
              + public_network_acl_id                       = ""
              + public_route_table_association_ids          = []
              + public_route_table_ids                      = []
              + public_route_table_tags                     = []
              + public_subnet_arns                          = []
              + public_subnets                              = []
              + public_subnets_cidr_blocks                  = []
              + public_subnets_ipv6_cidr_blocks             = []
              + redshift_network_acl_arn                    = ""
              + redshift_network_acl_id                     = ""
              + redshift_public_route_table_association_ids = []
              + redshift_route_table_association_ids        = []
              + redshift_route_table_ids                    = []
              + redshift_subnet_arns                        = []
              + redshift_subnet_group                       = ""
              + redshift_subnets                            = []
              + redshift_subnets_cidr_blocks                = []
              + redshift_subnets_ipv6_cidr_blocks           = []
              + route_tables                                = (known after apply)
              + tgw_internet_gateway_route_id               = ""
              + tgw_ipv6_egress_route_id                    = ""
              + tgw_nat_gateway_route_ids                   = []
              + tgw_network_acl_arn                         = (known after apply)
              + tgw_network_acl_id                          = (known after apply)
              + tgw_route_table_association_ids             = [
                  + (known after apply),
                  + (known after apply),
                ]
              + tgw_route_table_ids                         = (known after apply)
              + tgw_route_table_tags                        = [
                  + {
                      + Name           = "RTB-SGP-TST-02-PRT-TGW-ALL"
                      + RouteTableType = "tgw"
                    },
                ]
              + tgw_subnet_arns                             = [
                  + (known after apply),
                  + (known after apply),
                ]
              + tgw_subnets                                 = [
                  + (known after apply),
                  + (known after apply),
                ]
              + tgw_subnets_cidr_blocks                     = [
                  + "172.19.76.128/28",
                  + "172.19.76.144/28",
                ]
              + tgw_subnets_ipv6_cidr_blocks                = [
                  + null,
                  + null,
                ]
              + this_customer_gateway                       = {}
              + vgw_arn                                     = ""
              + vgw_id                                      = ""
              + vpc_arn                                     = (known after apply)
              + vpc_cidr_block                              = "172.19.76.0/25"
              + vpc_enable_dns_hostnames                    = true
              + vpc_enable_dns_support                      = true
              + vpc_flow_log_cloudwatch_iam_role_arn        = ""
              + vpc_flow_log_destination_arn                = ""
              + vpc_flow_log_destination_type               = "cloud-watch-logs"
              + vpc_flow_log_id                             = ""
              + vpc_id                                      = (known after apply)
              + vpc_instance_tenancy                        = "default"
              + vpc_ipv6_association_id                     = (known after apply)
              + vpc_ipv6_cidr_block                         = (known after apply)
              + vpc_main_route_table_id                     = (known after apply)
              + vpc_owner_id                                = (known after apply)
              + vpc_secondary_cidr_blocks                   = [
                  + "172.19.76.128/26",
                ]
            }
        }
    }

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
